erpdev.СХК_Расширение/src/DataProcessors/МобильныйСклад/МобильныйСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МобильныйСклад</name>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/AccumulationRegisters/СХК_ТоварыНаСкладе/СХК_ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СХК_ТоварыНаСкладе</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СХК_СкладЯчейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/InformationRegisters/Расш1_РегистрШтрихЭтикетка/Расш1_РегистрШтрихЭтикетка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Расш1_РегистрШтрихЭтикетка</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/Documents/ЗаказНаПроизводство2_2/ЗаказНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04b45cc8-19da-4fc2-ab25-fcf16e66f5ee">
  <name>ЗаказНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="5674c843-2642-4871-9160-0d93006f0add">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8b15-f8e1-48f5-a895-0a0068c7711a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9965e1bc-ce9d-4432-8e20-794e5ead177a">
    <name>ВариантОбособления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="15fca05d-7959-4a2b-9062-e424f3982539">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25c088f7-7f66-4e72-9549-39343550e4b5">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f1e30099-86a8-4d01-b947-c8d4e48da517">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff56eabe-a6d5-4725-a7e1-6d3c1cffefbc">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1c87bbe-4236-4da6-901a-bda05277a9f2">
    <name>РазмещениеВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0dd02b32-fdf8-46a0-b121-bd1aed1c77f6">
    <name>ТипПроизводственногоПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f569d9b-0875-46e5-af66-0afc714c2046">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5386e5e0-cdc1-4016-a59f-f459a6745b05">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0def1be0-f815-4bbb-a4d3-dbc07cf4d5f6">
    <name>СпособРаспределенияЗатратНаВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d77a8d5f-e794-448d-9882-9f1dda78982b">
    <name>ЗаказПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e68cfa9f-a198-4db0-b33e-480ff9fb854b">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c067e5d2-9a4a-46cc-b7ba-cc5d39841051">
    <name>НазначениеПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="91b5bd8a-a202-4ee3-a07e-d2244bd4d2bb">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bba76997-9f21-401b-ae65-37cef98dda2a">
    <name>ОбособленноеОбеспечениеМатериаловИРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6df6fc76-a3cd-4de0-a023-25f5c09faf10">
    <name>НачатьНеРанее</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="191fc3ee-3065-4648-ad89-72b3cbf6a108">
    <name>ДатаПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb924568-6ab5-4bc3-9ed4-53888e5a2470">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eeb90a1d-fe9d-4d2c-9f7b-1bae6a5317b2">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88a5e505-c602-47c9-9dd8-4b109bf0874f">
    <name>ДинамическаяСтруктура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c294200d-e023-448f-bc98-02cfabea5b0d">
    <name>УкрупненныйЗаказПоНазначениямПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_Этаж</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СХК_Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="404e1a8a-c6a1-46fb-8fba-6480a129a9b2">
    <name>ДоговорНеОбязателен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01fbf6b7-c4b6-4173-a0e2-5e454a3980f7">
    <name>ДатаПотребностиУказываетсяВСтроках</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0190487c-4b35-4793-bebb-cdc5d67bf079">
    <name>Продукция</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="7a6e457f-9de3-483b-9f11-8235c0db3365">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="233b5572-d99b-45e9-a762-f4936b94aac4">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dd131bed-f4cf-4ccb-8427-639b59bd5bf2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a32405d7-b213-4b91-8842-bc3b27c23a17">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f6dddb67-6919-4a89-9265-9a486b1adc13">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8fb6ec89-8b54-4467-a7ee-20b1f54a8233">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4c67ff09-dc6c-4f19-911a-2976ef5313b3">
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fbacbd26-236a-47f5-bb88-9d9c18122600">
      <name>СписатьНаРасходы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ce2f7918-6eb6-44a1-9703-eaa30ed728d8">
      <name>Спецификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2a65c298-0b01-4992-9536-0f68782c88a3">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8bec9438-5df6-40c3-b8e7-9f215d521294">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="31cf0d4b-bc85-4403-9def-9a0943d6cf54">
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f3fdba30-a333-460d-ba0e-4df1604b8439">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="164c9f1e-c498-4657-8d77-c67959ec545e">
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c420c750-bfd8-4a31-8040-84765c9c2998">
      <name>ДоляСтоимости</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Расш1_Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="cdf737d9-9b24-4864-95cf-cd1edb6e9b02">
      <name>ДатаПотребности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Catalogs/СХК_СкладЯчейки/СХК_СкладЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СХК_СкладЯчейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМестимость</name>
    <type>
      <types>EnumRef.СХК_ВМестимость</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/DataProcessors/МобильныйСклад/Forms/ОрдерВыбор/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если СтруктураПараметров.Номенклатура <> "" Тогда  
		ЭтаФорма.Номенклатура = СтруктураПараметров.Номенклатура;		
		ЭтаФорма.Серия = СтруктураПараметров.Серия; 
		ЭтаФорма.ИтогоКоличество = СтруктураПараметров.ИтогоКоличество;
		ЭтаФорма.КоличествоПоДок  =СтруктураПараметров.Количество; 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
		|	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
		|ГДЕ
		|	СХК_ТоварыНаСкладеОстатки.Серия = &Серия  
		|	И СХК_ТоварыНаСкладеОстатки.Номенклатура = &Номенклатура"; 
		Запрос.УстановитьПараметр("Серия",СтруктураПараметров.Серия.Наименование);
		Запрос.УстановитьПараметр("Номенклатура",СтруктураПараметров.Номенклатура);
		Р = Запрос.Выполнить();
		СпособОбхода = ОбходРезультатаЗапроса.Прямой;
		ТЗнач = Р.Выгрузить(СпособОбхода); 
		Если ТЗнач.Количество() = 1 Тогда 
			ЭтаФорма.Элементы.Доступно.Видимость = ЛОжь;
			ЭтаФорма.ДоступноеКоличество = ТЗнач.Итог("ВНаличииОстаток"); 
			ЭтаФорма.Элементы.ЯчейкаАдрес.Доступность = Ложь;
			Ячейка = ТЗнач[0].Ячейка;
				ТТ = Доступно.Добавить();
				ТТ.Ячейка = ТЗнач[0].Ячейка;
				ТТ.Количество = ТЗнач[0].ВНаличииОстаток;

		ИначеЕсли ТЗнач.Количество() >= 1 Тогда
			Для Каждого стр из ТЗнач Цикл
				ТТ = Доступно.Добавить();
				ТТ.Ячейка = стр.Ячейка;
				ТТ.Количество = стр.ВНаличииОстаток;
			КонецЦикла;

			ЭтаФорма.ДоступноеКоличество = ТЗнач.Итог("ВНаличииОстаток");
			Список = Новый СписокЗначений; 
			Список.Очистить();
			Список.ЗагрузитьЗначения(ТЗнач.ВыгрузитьКолонку("Ячейка"));		
			ЭтаФорма.Элементы.ЯчейкаАдрес.СписокВыбора.ЗагрузитьЗначения(Список.ВыгрузитьЗначения());
		КонецЕсли; 
		
		ЗапросУп = Новый Запрос;
		ЗапросУп.Текст = "ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.ПометкаУдаления = &ПометкаУдаления
		|	И УпаковкиЕдиницыИзмерения.Владелец = &Владелец"; 
		ЗапросУп.УстановитьПараметр("ПометкаУдаления",Ложь);
		ЗапросУп.УстановитьПараметр("Владелец",СтруктураПараметров.Номенклатура);
		РезультатЗапросаУп = ЗапросУп.Выполнить();
		
		ЭтаФорма.Ячейка = Справочники.СХК_СкладЯчейки.ПустаяСсылка();
		
		Список = Новый СписокЗначений; 
		Список.Очистить();
		Список.ЗагрузитьЗначения(РезультатЗапросаУп.Выгрузить().ВыгрузитьКолонку("Ссылка"));		
		ЭтаФорма.Элементы.СЗУпаковки.СписокВыбора.ЗагрузитьЗначения(Список.ВыгрузитьЗначения());
		
	КонецЕсли;
	ЭтаФорма.Элементы.Количество.Доступность = Ложь;
	ЭтаФорма.Элементы.Скан.Доступность = Ложь;
	ЭтаФорма.Элементы.Штрих.Доступность = Ложь;
	

КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	КоличествоПриИзмененииНаСервере()
КонецПроцедуры

&НаСервере
Процедура КоличествоПриИзмененииНаСервере() 
	ЭтаФорма.ИтогоКоличество =  ЭтаФорма.Количество;

	ИКол = ЭтаФорма.Количество;
	
	Если ИКол > ЭтаФорма.КоличествоПоДок  ТОгда
		Сообщить("Нельзя отгружать больше");
		ЭтаФорма.Элементы.Собран.Доступность = Ложь;
	Иначе
		ЭтаФорма.ИтогоКоличество = ИКол;
		ЭтаФорма.Элементы.Собран.Доступность = Истина;
		Т = ТЧКоличествоЯчейка.Добавить();
		Т.КоличествоС = ЭтаФорма.Количество;
		//Т.ЯчейкаС = ЭтаФорма.Ячейка;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЯчейкаАдресОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЯчейкаАдресОбработкаВыбораНаСервере(ВыбранноеЗначение);		
КонецПроцедуры  

&НаСервере
Процедура ЯчейкаАдресОбработкаВыбораНаСервере(Зн) 
	Яч = Справочники.СХК_СкладЯчейки.НайтиПоНаименованию(Зн) ; 
	ЭтаФорма.Ячейка = Яч;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	|ГДЕ
	|	СХК_ТоварыНаСкладеОстатки.Серия = &Серия
	|	И СХК_ТоварыНаСкладеОстатки.Ячейка = &Ячейка";
	Запрос.УстановитьПараметр("Серия",ЭтаФорма.Серия );
	Запрос.УстановитьПараметр("Ячейка",Яч); 
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		ЭтаФорма.ДоступноеКоличество = Рез.ВНаличииОстаток;		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СобранПриИзменении(Элемент)  

	ЭтаФорма.Закрыть();	
КонецПроцедуры 

&НаСервере 
Функция СобранПриИзмененииНаСервере()
		
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("Номенклатура",Номенклатура);
	СтуктураВозврат.Вставить("Серия",Серия);
	СтуктураВозврат.Вставить("ИтогоКоличество",ИтогоКоличество); 
	СтуктураВозврат.Вставить("ТЗ",ТЧКоличествоЯчейка);
	ОповеститьОВыборе(СтуктураВозврат); 
КонецПроцедуры

//&НаКлиенте
//Процедура ШтрихИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
////	Элементы.ГруппаНоменклатура.Видимость = Истина; 
////	Элементы.Добавить.Видимость = Истина;  

//	Если ПроверкаНаЧисло(Текст) = Истина Тогда
//		ПоискШКТест(Текст);
//	Иначе
//		Для сч = 3 по 7 Цикл
//			Т = ПоискQR(Текст,сч);
//			Если Т <> Ложь Тогда
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//		Если Т <> Ложь ТОгда

//			СоздатьГруппыРезультата(Т);
//		Иначе
//			Сообщить("Остаток 0");
//		КонецЕсли;
//		
//	КонецЕсли;  

//КонецПроцедуры

&НаСервере
Процедура ПоискШКТест(Ш)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Расш1_РегистрШтрихЭтикетка.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Расш1_РегистрШтрихЭтикетка КАК Расш1_РегистрШтрихЭтикетка
	|ГДЕ
	|	Расш1_РегистрШтрихЭтикетка.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Ш); 

	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода);  
	
	Если ТабЗнач.Количество()>0 Тогда 
		//Запрос1 = Новый Запрос;
		//Запрос1.Текст = "ВЫБРАТЬ
		//|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
		//|	ЗаказНаПроизводство2_2Продукция.Расш1_Серия КАК Расш1_Серия
		//|ИЗ
		//|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
		//|ГДЕ
		//|	ЗаказНаПроизводство2_2Продукция.Ссылка.Дата >= &Дата
		//|	И ЗаказНаПроизводство2_2Продукция.Номенклатура =  &Номенклатура";  
		//
		//Запрос1.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата())-360*86400);
		//Запрос1.УстановитьПараметр("Номенклатура", ТабЗнач[0].Номенклатура);
		//
		//Номенклатура = "";
		//Серия = "";
		//Количество = 0;  
		//Номенклатура = ТабЗнач[0].Номенклатура; 
		//
		//РезультатЗапроса = Запрос1.Выполнить();
		//
		//ЭтаФорма.Ячейка = Справочники.СХК_СкладЯчейки.ПустаяСсылка();
		//

		//СписокСерий = Новый СписокЗначений; 
		//СписокСерий.Очистить();
		//СписокСерий.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Расш1_Серия"));
		//Если СписокСерий.Количество() = 1 Тогда
		//	ЭтаФорма.Серия = СписокСерий[0].Значение;	
		//Иначе
		//	ЭтаФорма.Элементы.ВыбСерия.СписокВыбора.ЗагрузитьЗначения(СписокСерий.ВыгрузитьЗначения()); 
		//КонецЕсли;
		//
		//
		//ЗапросУп = Новый Запрос;
		//ЗапросУп.Текст = "ВЫБРАТЬ
		//|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		//|ИЗ
		//|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		//|ГДЕ
		//|	УпаковкиЕдиницыИзмерения.ПометкаУдаления = &ПометкаУдаления
		//|	И УпаковкиЕдиницыИзмерения.Владелец = &Владелец"; 
		//ЗапросУп.УстановитьПараметр("ПометкаУдаления",Ложь);
		//ЗапросУп.УстановитьПараметр("Владелец",ТабЗнач[0].Номенклатура);
		//РезультатЗапросаУп = ЗапросУп.Выполнить();
		//
		//ЭтаФорма.Ячейка = Справочники.СХК_СкладЯчейки.ПустаяСсылка();
		//
		//Список = Новый СписокЗначений; 
		//Список.Очистить();
		//Список.ЗагрузитьЗначения(РезультатЗапросаУп.Выгрузить().ВыгрузитьКолонку("Ссылка"));		
		//ЭтаФорма.Элементы.СЗУпаковки.СписокВыбора.ЗагрузитьЗначения(Список.ВыгрузитьЗначения());
		//ЭтаФорма.Элементы.Штрих.Доступность = Ложь;  
		//ЭтаФорма.Элементы.СЗУпаковки.Доступность = Истина;

		//ЭтаФорма.Элементы.Скан.Доступность = Истина;
	Иначе
		//Оповещение = Новый ОписаниеОповещения("НачалоСтартаСписокПолучателей",ЭтотОбъект);
		//ПоказатьВопрос(Оповещение,
		//    "Заполните список",
		//    РежимДиалогаВопрос.ОК,
		//    0, // таймаут в секундах
		//    , // (необ.) кнопка по умолчанию
		//    "Заполнить список получателей" // (необ.) заголовок
		//);
		Сообщить("Не верная номенклатура");	
		//ЭтаФорма.Элементы.Количество.Доступность = Ложь;
		//ЭтаФорма.Элементы.Скан.Доступность = Ложь;

	КонецЕсли;
	
	
КонецПроцедуры   

&НаКлиенте
Процедура НачалоСтартаСписокПолучателей(Результат, Параметры) Экспорт
    ЭтаФорма.Элементы.Количество.Доступность = Ложь;

КонецПроцедуры


&НаСервере
Функция ПоискQR(Ш,сим)
	Мас = Новый Массив;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
	|	ЗаказНаПроизводство2_2Продукция.Расш1_Серия КАК Расш1_Серия
	|ИЗ
	|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	|ГДЕ
	|	ЗаказНаПроизводство2_2Продукция.Ссылка.Дата >= &Дата
	|	И ЗаказНаПроизводство2_2Продукция.Расш1_Серия.Наименование = &Серия";   
	
	Запрос.УстановитьПараметр("Серия", Ш);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата())-360*86400); 	
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = "ВЫБРАТЬ
	|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
	|	ЗаказНаПроизводство2_2Продукция.Расш1_Серия КАК Расш1_Серия
	|ИЗ
	|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	|ГДЕ
	|	ЗаказНаПроизводство2_2Продукция.Ссылка.Дата >= &Дата
	|	И ЗаказНаПроизводство2_2Продукция.Расш1_Серия.Наименование ПОДОБНО &Серия";   
	//|	ТоварыНаСкладахОстатки.Серия.Наименование =  &Серия";
	
	СтрокаСерия = Лев(Ш,сим);
	СтрокаСерия = СтрокаСерия+Строка("%"+Прав(Ш,11));
	Запрос1.УстановитьПараметр("Серия", СтрокаСерия);
	Запрос1.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата())-360*86400); 	
	Рез1 = Запрос1.Выполнить().Выбрать(); 
	
	
	Если Рез.Количество()>0 Тогда
		Пока Рез.Следующий() Цикл
			СЗ = Новый Структура;
			СЗ.Вставить("Номенклатура",Рез.Номенклатура);
			СЗ.Вставить("Серия",Рез.Расш1_Серия); 
			Мас.Добавить(СЗ);
		КонецЦикла;		//Ном = Рез.Номенклатура; 
	ИначеЕсли Рез1.Количество()>0 Тогда
		Пока Рез.Следующий() Цикл
			СЗ = Новый Структура;
			СЗ.Вставить("Номенклатура",Рез.Номенклатура);
			СЗ.Вставить("Серия",Рез.Расш1_Серия); 
			Мас.Добавить(СЗ);
		КонецЦикла;
	Иначе
		
		Мас = Ложь;	
	КонецЕсли;
	
	Возврат Мас;
	
КонецФункции 

&НаСервере
Процедура СоздатьГруппыРезультата(м)  
	
	Номенклатура = "";
	Серия = "";
	Количество = 0;  
	Номенклатура = м[0].Номенклатура; 
	Если м[0].Серия <> "" Тогда
		Серия = м[0].Серия; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.ПометкаУдаления = &ПометкаУдаления
		|	И УпаковкиЕдиницыИзмерения.Владелец = &Владелец"; 
		Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
		Запрос.УстановитьПараметр("Владелец",Номенклатура);
		РезультатЗапроса = Запрос.Выполнить();
		
		ЭтаФорма.Ячейка = Справочники.СХК_СкладЯчейки.ПустаяСсылка();
		
		Список = Новый СписокЗначений; 
		Список.Очистить();
		Список.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));		
		ЭтаФорма.Элементы.СЗУпаковки.СписокВыбора.ЗагрузитьЗначения(Список.ВыгрузитьЗначения()); 
        ЭтаФорма.Элементы.Скан.Доступность = Ложь; 
		ЭтаФорма.Элементы.Штрих.Доступность = Истина;
        //СписокСерий = Новый СписокЗначений; 
		//СписокСерий.Очистить();
		//Список.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));		
		//ЭтаФорма.Элементы.СЗУпаковки.СписокВыбора.ЗагрузитьЗначения(Список.ВыгрузитьЗначения()); 
	
	Иначе
		ЭтаФорма.ТекущийЭлемент = Элементы.Серия;
	КонецЕсли;
		
	
КонецПроцедуры


&НаСервере
Функция ПроверкаНаЧисло(НашаСтрокаДляРазбора) Экспорт
	Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Число") Тогда
		Возврат Истина
	Иначе
		Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Строка") Тогда
			Если НашаСтрокаДляРазбора = "" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ПМ = Число(НашаСтрокаДляРазбора);
		Исключение
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина;
	КонецЕсли;
КонецФункции 






&НаСервере
Функция ПроверитьЯчейку(Ш)
	
	Ош = Ложь;
	Я = Справочники.СХК_СкладЯчейки.НайтиПоРеквизиту("ШтрихКод",СокрЛП(Ш));
	Если Я.Пустая() = Ложь Тогда 
		//
		ЗапросТ = Новый Запрос;
		ЗапросТ.Текст = "ВЫБРАТЬ
		|	СХК_СкладЯчейки.Ряд КАК Ряд,
		|	СХК_СкладЯчейки.Ячейка КАК Ячейка
		|ИЗ
		|	Справочник.СХК_СкладЯчейки КАК СХК_СкладЯчейки
		|ГДЕ
		|	СХК_СкладЯчейки.ШтрихКод = &ШтрихКод";   
		ЗапросТ.УстановитьПараметр("ШтрихКод",Ш); 
		РезультатТ = ЗапросТ.Выполнить();
		СпособОбхода = ОбходРезультатаЗапроса.Прямой;
		ТабЗначТ = РезультатТ.Выгрузить(СпособОбхода);   
		
		ЗапросЯчеек = Новый Запрос;
		ЗапросЯчеек.Текст = "ВЫБРАТЬ
		|	СХК_СкладЯчейки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СХК_СкладЯчейки КАК СХК_СкладЯчейки
		|ГДЕ
		|	СХК_СкладЯчейки.Ряд = &Ряд
		|	И СХК_СкладЯчейки.Ячейка = &Ячейка";
		
		ЗапросЯчеек.УстановитьПараметр("Ряд",ТабЗначТ[0].Ряд);
		ЗапросЯчеек.УстановитьПараметр("Ячейка",ТабЗначТ[0].Ячейка); 
		РезультатЗапросаТ = ЗапросЯчеек.Выполнить();
		СпособОбхода = ОбходРезультатаЗапроса.Прямой;
		ТабЗначТТ = РезультатЗапросаТ.Выгрузить(СпособОбхода); 
		//СЗ = Новый СписокЗначений;
		//СЗ.ЗагрузитьЗначения(ТабЗначТТ.ВыгрузитьКолонку("Ссылка"));
		//		ЗапросОст = Новый Запрос;
		//		ЗапросОст.Текст = "ВЫБРАТЬ
		//		                  |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
		//		                  |	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка
		//		                  |ИЗ
		//		                  |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
		//		                  |ГДЕ
		//		                  |	СХК_ТоварыНаСкладеОстатки.Серия = &Серия
		//		                  |	И СХК_ТоварыНаСкладеОстатки.Номенклатура = &Номенклатура
		//		                  |	И СХК_ТоварыНаСкладеОстатки.Ячейка.Наименование В(&Ячейка)"; 
		//		ЗапросОст.УстановитьПараметр("Серия",Серия.Наименование);
		//		ЗапросОст.УстановитьПараметр("Номенклатура",Номенклатура);
		//		ЗапросОст.УстановитьПараметр("Ячейка",СЗ); 
		//		РезТТ = ЗапросОст.Выполнить().Выбрать();
		
		///
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
		|	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
		|ГДЕ
		|	СХК_ТоварыНаСкладеОстатки.Серия = &Серия
		|	И СХК_ТоварыНаСкладеОстатки.Номенклатура = &Номенклатура
		|	И СХК_ТоварыНаСкладеОстатки.Ячейка = &Ячейка"; 
		Запрос.УстановитьПараметр("Серия",Серия.Наименование);
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		Запрос.УстановитьПараметр("Ячейка",Я);  
		Рез = Запрос.Выполнить().Выбрать();
		Если Рез.Количество()>=1 Тогда 
			Пока Рез.Следующий() Цикл
				Ячейка = Рез.Ячейка;
				Прервать;
			КонецЦикла;
			ЭтаФорма.ТекущийЭлемент = Элементы.Штрих;
			Ош = Истина;
		ИначеЕсли ТабЗначТТ.Количество()>=1 Тогда 
			Для Каждого стрТ из ТабЗначТТ Цикл
				К = ПоискОстПоРяду(стрТ,Серия.Наименование,Номенклатура);
				Если К <> Ложь Тогда
					Ячейка = К;
					Прервать; 
				КонецЕсли;
			КонецЦикла;
			ЭтаФорма.ТекущийЭлемент = Элементы.Штрих;
			Ош = Истина;
			
		КонецЕсли;
	КонецЕсли;
	Возврат Ош;
КонецФункции             

&НаСервере
Функция ПоискОстПоРяду(РядК,Серия,Ном)
	ош = Ложь;	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	|ГДЕ
	|	СХК_ТоварыНаСкладеОстатки.Серия = &Серия
	|	И СХК_ТоварыНаСкладеОстатки.Номенклатура = &Номенклатура
	|	И СХК_ТоварыНаСкладеОстатки.Ячейка = &Ячейка"; 
	Запрос.УстановитьПараметр("Серия",Серия);
	Запрос.УстановитьПараметр("Номенклатура",Ном);
	Запрос.УстановитьПараметр("Ячейка",РядК.Ссылка );  
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Количество()>=1 Тогда 
		Пока Рез.Следующий() Цикл
			ош = Рез.Ячейка;
			Прервать;
		КонецЦикла; 
	КонецЕсли;
	Возврат ош;
КонецФункции


&НаКлиенте
Процедура СканИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка) 
	Если ПроверитьЯчейку(Текст) = Истина Тогда
		ЭтаФорма.Элементы.Штрих.Доступность = Истина; 
	Иначе
		Сообщить("Не верная ячейка");
		ЭтаФорма.Элементы.Штрих.Доступность = Ложь;
	КонецЕсли;  
	
	
КонецПроцедуры  


&НаСервере
Функция ПроверитьQR(Ш,сим)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
	|	ЗаказНаПроизводство2_2Продукция.Расш1_Серия КАК Расш1_Серия
	|ИЗ
	|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	|ГДЕ
	|	ЗаказНаПроизводство2_2Продукция.Ссылка.Дата >= &Дата
	|	И ЗаказНаПроизводство2_2Продукция.Расш1_Серия.Наименование = &Серия";   
	
	Запрос.УстановитьПараметр("Серия", Ш);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата())-360*86400); 	
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = "ВЫБРАТЬ
	|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
	|	ЗаказНаПроизводство2_2Продукция.Расш1_Серия КАК Расш1_Серия
	|ИЗ
	|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	|ГДЕ
	|	ЗаказНаПроизводство2_2Продукция.Ссылка.Дата >= &Дата
	|	И ЗаказНаПроизводство2_2Продукция.Расш1_Серия.Наименование ПОДОБНО &Серия";   
	//|	ТоварыНаСкладахОстатки.Серия.Наименование =  &Серия";
	
	СтрокаСерия = Лев(Ш,сим);
	СтрокаСерия = СтрокаСерия+Строка("%"+Прав(Ш,11));
	Запрос1.УстановитьПараметр("Серия", СтрокаСерия);
	Запрос1.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата())-30*86400); 	
	Рез1 = Запрос1.Выполнить().Выбрать(); 
	
	
	Если Рез.Количество()>0 Тогда
    	Ош = Ложь; 
	ИначеЕсли Рез1.Количество()>0 Тогда
		Ош = Ложь;
	Иначе
		Ош = Истина;
	КонецЕсли;
	
	Возврат Ош;
	
КонецФункции 

&НаСервере
Функция ПроверитьШК(Ш)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Расш1_РегистрШтрихЭтикетка.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Расш1_РегистрШтрихЭтикетка КАК Расш1_РегистрШтрихЭтикетка
	|ГДЕ
	|	Расш1_РегистрШтрихЭтикетка.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Ш); 

	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода);  
	
	Если ТабЗнач.Количество()>0 Тогда 
		Ош = Ложь;
	Иначе
		Ош = Истина;
	КонецЕсли;
	
	Возврат Ош;
	
КонецФункции 

&НаКлиенте
Процедура СЗУпаковкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	СЗУпаковкиПриИзмененииНаСервере(ВыбранноеЗначение);
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Скан;
КонецПроцедуры  

&НаСервере
Процедура СЗУпаковкиПриИзмененииНаСервере(Эл)  
	ЭтаФорма.Упаковка = Эл;
	//ЭтаФорма.Количество = 0;  
	ЭтаФорма.Элементы.Количество.Доступность = Истина;
	ЭтаФорма.Элементы.Скан.Доступность = Истина;  
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыбСерияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыбСерияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Серия =  ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура ШтрихИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если ПроверкаНаЧисло(Текст) = Истина Тогда
		Т = ПоискШКН(Текст);
	ИначеЕсли СокрЛП(Текст) = СерияНаименование() Тогда
   		Т = Истина;
	Иначе
		Т = Ложь;
	КонецЕсли;  
	
	Если Т = Истина Тогда 
		СканИзменениеТекстаРедактированияНаСервере();
		Если ЭтаФорма.Собран = Истина Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
		
	Иначе
		Сообщить("Не верная номенклатура");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СерияНаименование()
	Возврат ЭтаФорма.Серия.Наименование;
КонецФункции

&НаСервере
Функция ПоискШКН(Ш)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Расш1_РегистрШтрихЭтикетка.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Расш1_РегистрШтрихЭтикетка КАК Расш1_РегистрШтрихЭтикетка
	|ГДЕ
	|	Расш1_РегистрШтрихЭтикетка.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Ш); 

	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода);  
	
	Если ТабЗнач.Количество()>0 Тогда
		Ош = Истина;
	Иначе
		Ош = "Не верная номенклатура";	
	КонецЕсли;
	
	Возврат Ош; 
	
КонецФункции   

&НаСервере
Процедура СканИзменениеТекстаРедактированияНаСервере()

    ЭтаФорма.Количество = ЭтаФорма.Количество + ЭтаФорма.Упаковка.Числитель;
   	ИКол = ЭтаФорма.Количество;
	
	Если ИКол > ЭтаФорма.КоличествоПоДок  ТОгда
		Сообщить("Нельзя отгружать больше");
		ЭтаФорма.Элементы.Собран.Доступность = Ложь;
	Иначе
		ЭтаФорма.ИтогоКоличество = ИКол;
		ЭтаФорма.Элементы.Собран.Доступность = Истина;
		Т = ТЧКоличествоЯчейка.Добавить();
		Т.КоличествоС = ЭтаФорма.Упаковка.Числитель;
		Т.ЯчейкаС = Ячейка;
	КонецЕсли; 
	
	Если ЭтаФорма.КоличествоПоДок = ЭтаФорма.ИтогоКоличество Тогда
		Собран = Истина;
	КонецЕсли;
	

КонецПроцедуры
